<html>

<head>
<meta charset="utf-8">
<title>Старые технологии</title>
</head>

<body>
<?php
require "header.php";
?>

<center><h1>Склад старья</h1></center>
<center><a>Здесь я максимально кратко описал несколько интересных мне старых технологий, программ и т.д.</a></center>
<center><a href="search_tech.php" target="a_blank">Найти о них подробную информацию</a>

<div class="a">
</div>

<h1>WAP и GPRS</h1>
<a>Сейчас мобильный интернет стал обыденностью в СНГ. Он входит в состав довольно выгодных тарифов от различных операторов и скорость у него очень даже неплоха. Но... Все эти: 3G, 4G, LTE появились относительно недавно. В 00-х за бешенные деньги некоторые люди подключали либо WAP (Wireless Application Protocol), либо GPRS (General Packet Radio Service). Они находились под сетью GSM. Но как я уже сказал, стоили дорого + скорость мягко говоря, была не очень</a>

<div class="a">
</div>

<h1>Текстовый этап установки Windows</h1>
<a>Раньше, установки винды делилась на 2 этапа - текстовый и графический. Текстовый этап установки Windows существовал с NT 3.1 и до XP включительно. Данный этап установки появляется сразу после загрузки образа операционной системы и в ней нам предлагают отформотировать диск (раньше там также была функция настройки устройств). После чего, идет медленное формотирование жесткого диска и копирование файлов. А затем - графический этап установки. В Windows Vista от такого этапа установки было решено отказаться.</a>

<div class="a">
</div>

<h1>Marmallade SDK</h1>
<a>Marmallade SDK - крайне популярный в прошлом игровой движок, который раньше даже конкурировал с Unity и Unreal Engine. На нем например были написаны: Shadow Fight 2, Cut the Rope и так далее. Для данного движка требовалась лицензия на каждый компьютер, который его использует. В 2017, не выдержав конкуренции с Unity и UE4 - был закрыт</a>

<style>
.a {
	border-bottom: 1px solid silver;
}
</style>

</body>

</html>